#include<stdio.h>
//整型提升
//int main()
//{
//	int a = -10;
//	unsigned int b = 5;
//	if (a + b > 0)//a和b运算时，编译器会将a隐式类型转换为unsigned类型
//	{
//		printf(">0\n");
//	}
//	else
//	{
//		printf("<0\n");
//	}
//	return 0;
//}

#if 0
int main()
{
	char a = 0x80;//1000 0000
	unsigned char b = 0x80;//1000 0000
	unsigned int c = a;//对a隐式类型转换
	// 1111 1111 1111 1111 1111 1111 1000 0000
	int d = a;
	//
	//在c=a和c=d中，都是对a进行扩充，a为正数高位扩充0，为负数高位扩充1
	printf("a=%d,a=%u\n", a, a);
	//a定义位signed型，%d形式读出的是将0x80转换为原码取后八位1 0000 0000  即十进制 -128
	//当以%u形式输出时，先进行隐式类型转换，系统将a默认转换成unsigned int类型，在这期间对a进行扩充，a为负数,因此前面扩充位全为 为：1111 1111 1111 1111 1111 1111 1000 0000直接读出就行
	printf("b=%d,b=%u\n", b, b);
	//b的定义为unsigned char ,和a在内存中的存储形式相同，但是以%u形式输出时隐式类型转换过程中高位扩充全0到四个字节，再输出
	//1000 0000				0000 0000 0000 0000 0000 0000 1000 0000
	printf("c=%d,c=%u\n", c, c);
	//内存中：1111 1111 1111 1111 1111 1111 1000 0000
	//%d读取转换成原码：1000 0000 0000 0000 0000 0000 1000 0000
	printf("d=%d,d=%u\n", d, d);
	//d编译器默认为signed类型，当执行int d=a后，所以d的存储形式为：
	//1111 1111 1111 1111 1111 1111 1000 0000
	//以%d读取时转换为原码：1000 0000 0000 0000 0000 0000 1000 0000
	return 0;
}
int main()
{
	char a = -1;
	signed char b = -1;
	unsigned char c = -1;//隐式类型转换
	//c在内存中的存储形式： -1的补码  1111 1111,转换为unsigned形式为 1111 1111 1111 1111 1111 1111 1111 1111 
	//%d读取:1111 1111 1111 1111 1111 1111 1111 1111的后四位1111 1111
	printf("%d,%d,%d", a, b, c);
	return 0;
}
int main()
{
	char a = -128;
	//内存中查看为0x80  即内存中为：1000 0000
	//取反加1且符号位不变得原码：1000 0000  与补码相同
	//直接扩充：1111 1111 1111 1111 1111 1111 1000 0000
	char b = -127;
	//原码：1111 1111
	//补：1000 0001
	//%u扩充：1111 1111 1111 1111 1111 1111 1000 0001
	char c = -126;
	//以%u形式输出有两种扩充方式：
	//1.-126的32位原码为：1000 0000 0000 0000 0000 0000 0111 1110
	//转换为补码形式：1111 1111 1111 1111 1111 1111 1000 0010

	//2.c为char型数据，原码为：1111 1110
	//内存中的存储为：1000 0010    再扩充为32位（负数扩充符号位）：1111 1111 1111 1111 1111 1111 1000 0010
	printf("%d %d %d\n", a, b, c);
	printf("%u %u %u\n", a, b, c);
	return 0;
}
#endif
//int main()
//{
//	//给一个char类型的变量赋值128和-128,以%d和%u分别打印出来的结果均是相同的，其本质是两个数在内存中的存储形式相同
//	//都知道-128 在内存中是以1000 0000 的形式存放，那么128为什么也是以这种形式存放？
//	//128可以看作127+1而来，127在内存中的存储形式0111 1111  +1  0000 0001
//	//可得：128的存储形式为 1000 0000
//	//其实char类型的数据取值范围-128~127
//	char a = -128;
//	//1000 0000
//	//1111 1111 1111 1111 1111 1111 1000 0000
//	//printf("%u\n", a);
//	char b = 128;//
//	//char b=128;就相当于127+1  
//	//1111 1111 1111 1111 1111 1111 1000 0000
//	//printf("%u\n", b);
//	printf("%u %u\n", a, b);
//	printf("%d %d\n", a, b);
//	return 0;
//}
//浮点数的存储方式：SEM 32  :S 符号位 -1^s ,E 8个指数尾   ，M 23个有效位 0
//int main()
//{
//	int a = 6;
//	float b = 4.6;
//	//printf("%d\n",b);
//	//printf("%d\n", (int)b);
//	return 0;
//}